Revit 2027 API
AnalyticalNodeData.GetAnalyticalNodeData Method
 Returns AnalyticalNodeData associated with this element, if it exists.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static AnalyticalNodeData GetAnalyticalNodeData(
	Element element
)
Public Shared Function GetAnalyticalNodeData (
	element As Element
) As AnalyticalNodeData
public:
static AnalyticalNodeData^ GetAnalyticalNodeData(
	Element^ element
)
static member GetAnalyticalNodeData :
        element : Element -> AnalyticalNodeData
Parameters
element Element
 The element from which we try to obtain AnalyticalNodeData.
Return Value
AnalyticalNodeData
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 If the input element doesn't have AnalyticalNodeData than it retuns null. The input element should be a ReferencePoint.
See Also
Reference
AnalyticalNodeData Class
Autodesk.Revit.DB.Structure Namespace